In [1]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [41]:
df.columns = ['first_name', 'last_name','email']

In [42]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [43]:
df.columns = [x.upper() for x in df.columns]

In [45]:
df.columns
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [46]:
df.columns = df.columns.str.replace('_','')
df

  FIRSTNAME LASTNAME                    EMAIL
0     Corey  Schafer  CoreyMSchafer@gmail.com
1      Jane      Doe        JaneDoe@email.com
2      John      Doe        JohnDoe@email.com

In [50]:
df.columns = df.columns.str.replace('_','')
df

  FIRSTNAME LASTNAME                    EMAIL
0     Corey  Schafer  CoreyMSchafer@gmail.com
1      Jane      Doe        JaneDoe@email.com
2      John      Doe        JohnDoe@email.com

In [53]:
df.columns = ['first_name', 'last_name','email']
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [55]:
df.rename(columns ={'fisrst_name':'first','last_name':'last'},inplace = True)
df

  first_name     last                    email
0      Corey  Schafer  CoreyMSchafer@gmail.com
1       Jane      Doe        JaneDoe@email.com
2       John      Doe        JohnDoe@email.com

In [56]:
df.loc[2]

first_name                 John
last                        Doe
email         JohnDoe@email.com
Name: 2, dtype: object

In [57]:
print('to change the information in a specific column')
df.loc[2] = ['John','smith','JohnSmith@mail.com']
df

  first_name     last                    email
0      Corey  Schafer  CoreyMSchafer@gmail.com
1       Jane      Doe        JaneDoe@email.com
2       John    smith       JohnSmith@mail.com

In [58]:
print('grabbing the information on specific column such a last name and email')
df.loc[2,['last','email']]

grabbing the information on specific column such a last name and email

last                  smith
email    JohnSmith@mail.com
Name: 2, dtype: object

In [60]:
print('to set the data back to the original  data')
df.loc[2,['last','email']] = ['Doe','JohnDoe@email.com']
df

to set the data back to the original  data

  first_name     last                    email
0      Corey  Schafer  CoreyMSchafer@gmail.com
1       Jane      Doe        JaneDoe@email.com
2       John      Doe        JohnDoe@email.com

In [61]:
print('change the single value')
df.loc[2,'last'] = 'Smith'
df

change the single value

  first_name     last                    email
0      Corey  Schafer  CoreyMSchafer@gmail.com
1       Jane      Doe        JaneDoe@email.com
2       John    Smith        JohnDoe@email.com

In [62]:
print(' to find the specific value')
filt =(df['email']) == 'CoreyMSchafer@gmail.com'
df[filt]

 to find the specific value

  first_name     last                    email
0      Corey  Schafer  CoreyMSchafer@gmail.com

In [63]:
print('to change all the emails to lower case')
df['email']=df['email'].str.lower()
df

to change all the emails to lower case

  first_name     last                    email
0      Corey  Schafer  coreymschafer@gmail.com
1       Jane      Doe        janedoe@email.com
2       John    Smith        johndoe@email.com

In [65]:
print('using apply method to find the length of an email')
df['email'].apply(len)

using apply method to find the length of an email

0    23
1    17
2    17
Name: email, dtype: int64

In [66]:
print('to update email to the upper case')
def update_email(email):
    return email.upper()
df['email'].apply(update_email)

to update email to the upper case

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [69]:
print('convert to lowercase,APPLY WORRKS ON SERIES FUNCTION')
df['email'] = df['email'].apply(lambda x:x.lower())
df

convert to lowercase,APPLY WORRKS ON SERIES FUNCTION

  first_name     last                    email
0      Corey  Schafer  coreymschafer@gmail.com
1       Jane      Doe        janedoe@email.com
2       John    Smith        johndoe@email.com

In [70]:
print('')
df['email'].apply(len)

0    23
1    17
2    17
Name: email, dtype: int64

In [75]:
print('applies to the series and gives the number of elements present in each column')
df.apply(len)

applies to the series and gives the number of elements present in each column

first_name    3
last          3
email         3
dtype: int64

In [76]:
df.apply(len,axis= 'columns')

0    3
1    3
2    3
dtype: int64

In [77]:
len(df['email'])

3

In [78]:
df.apply(pd.Series.min)

first_name                      Corey
last                              Doe
email         coreymschafer@gmail.com
dtype: object

In [79]:
print('apply map works on series function')
df.apply(lambda x: x.min())

first_name                      Corey
last                              Doe
email         coreymschafer@gmail.com
dtype: object

In [80]:
print('applymap works on dataframe and strings')
df.applymap(len)

   first_name  last  email
0           5     7     23
1           4     3     17
2           4     5     17

In [81]:
df.applymap(str.lower)

  first_name     last                    email
0      corey  schafer  coreymschafer@gmail.com
1       jane      doe        janedoe@email.com
2       john    smith        johndoe@email.com

In [86]:
print('map method works on series to substitute one value with other value')

map method works on series to substitute one value with other value

In [93]:
df['first'] = df['first'].replace({'corey': 'chris', 'jane': 'Mary'})

KeyError: 'first'

In [94]:
print('renmane columns')
df.rename(columns = {'ConvertedComp': 'SalaryUSD'},inplace =True)

renmane columns

In [96]:
df.columns

Index(['first_name', 'last', 'email'], dtype='object')

In [97]:
df.head()

  first_name     last                    email
0      Corey  Schafer  coreymschafer@gmail.com
1       Jane      Doe        janedoe@email.com
2       John    Smith        johndoe@email.com